Revit 2024 API
SpotLightDistribution Members
The SpotLightDistribution type exposes the following members.
Constructors
Name | Description
SpotLightDistribution()
 Creates a spot light distribution object with the following values;
PI/6 radians spot beam angle
PI/2 radians spot field angle
PI/6 radians tilt angle
SpotLightDistribution(SpotLightDistribution)
 Creates a copy of the given spotlight distribution
SpotLightDistribution(Double, Double, Double)
 Creates a spot light distribution object with the given values.
Methods
Name | Description
Clone
 Creates a copy of the LightDistribution derived object.
 (Inherited from LightDistribution.)
Dispose |  (Inherited from LightDistribution.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from LightDistribution.)
SpotBeamAngle
 The spot beam angle.
SpotFieldAngle
 The spot field angle.
TiltAngle
 The tilt angle.
See Also
SpotLightDistribution Class
Autodesk.Revit.DB.Lighting Namespace